#include <stdio.h>

int main() {
    
    char filename[] = "data_source_1.dat";
    FILE *file = fopen(filename, "r");

    if (file == NULL) {
        printf("error: %s\n", filename);
        return 1;
    }

    double x = 1.0;
    double m, b;

    while(fscanf(file, "%lf %lf", &m, &b) == 2) {
        x = m * x + b;
    }
    printf("%.4lf\n", x);

    fclose(file);
    return 0;
}


/*
ไฟล์ data_source_1.dat เป็นไฟล์เท็กซ์ที่แต่ละบรรทัดมีข้อมูลจำนวนจริง 2 จำนวน คือ m และ b ตามลำดับ 
โดยที่ค่าทั้ง 2 จะถูกนำมาใช้นิยามฟังก์ชัน y = m * x + b
หากกำหนดให้ x มีค่าเริ่มต้นเป็น 1 เพื่อใช้หาค่า y จากข้อมูลบรรทัดแรก หลังจากนั้นค่า y ที่ได้นี้จะนำไปเป็นค่า x 
สำหรับการหาค่า y ของบรรทัดถัดไป  จงหาว่าค่า y ที่จะคำนวณได้จากบรรทัดสุดท้ายในไฟล์นี้มีค่าเป็นเท่าใด 
โดยให้เขียนคำตอบอยู่ในรูปของเลขจำนวนจริง 4 ตำแหน่ง เช่น -0.1230 เป็นต้น
*/