#include <stdio.h>

typedef struct {
    double m;
    double b;
} Record;


int main() {
    
    char filename[] = "data_source_2.dat";
    FILE *file = fopen(filename, "r");

    if (file == NULL) {
        printf("error: %s\n", filename);
        return 1;
    }

    while(fscanf(file, "%lf %lf", &Record.m, &Record.b) == 2) {

    }

    fclose(file);
    return 0;
}

/*
ไฟล์ data_source_2.dat เป็นไฟล์ไบนารีที่เก็บข้อมูลบล็อกของเรคคอร์ดเรียงต่อกันเป็นจำนวนมาก 
โดยทุกเรคคอร์ดในไฟล์มีโครงสร้างเหมือนกันดังแสดงในรูป และข้อมูลจำนวนจริงในแต่ละเรคคอร์ดใช้นิยามฟังก์ชัน y = m * x + b
หากกำหนดให้ x มีค่าเริ่มต้นเป็น 1 สำหรับเรคคอร์ดแรกในไฟล์เพื่อใช้หาค่า y  หลังจากนั้นค่า y 
ที่ได้นี้จะนำไปเป็นค่า x สำหรับการหาค่า y ของเรคคอร์ดถัดไป และคำนวณค่า y ในลักษณะเดียวกันนี้ถัดไปเรื่อย ๆ  
จงหาว่าค่า y ที่จะคำนวณได้จากเรคคอร์ดสุดท้ายในไฟล์นี้มีค่าเป็นเท่าใด โดยให้เขียนคำตอบอยู่ในรูปของเลขจำนวนจริง 4 ตำแหน่ง เช่น -0.1230 เป็นต้น
*/