#include <stdio.h>

typedef struct {
    double m;
    double b;
    int id;
} Record;

int main() {
    return 0;
}

/*
ไฟล์ data_source_4.dat เป็นไฟล์ไบนารีที่เก็บข้อมูลบล็อกของเรคคอร์ดเรียงต่อกันเป็นจำนวนมาก โดยทุกเรคคอร์ดในไฟล์มีโครงสร้างเหมือนกันดังแสดงในรูป และข้อมูลจำนวนจริงในแต่ละเรคคอร์ดใช้นิยามฟังก์ชัน y = m * x + b  ส่วนข้อมูลจำนวนเต็ม id ใช้กำหนดลำดับในการคำนวณหาค่า y 
หากกำหนดให้ x มีค่าเริ่มต้นเป็น 1 เพื่อนำมาใช้หาค่า y จากเรคคอร์ดที่มีค่า id น้อยที่สุด  หลังจากนั้นค่า y ที่ได้นี้จะนำไปเป็นค่า x สำหรับการหาค่า y ของเรคคอร์ดที่มีค่า id ในลำดับถัดไป และคำนวณค่า y ในลักษณะเดียวกันนี้จากเรคคอร์ด id ถัดไปเรื่อย ๆ  จงหาว่าค่า y ที่จะคำนวณได้จากเรคคอร์ดที่มีค่า id สูงสุดในไฟล์นี้มีค่าเป็นเท่าใด โดยให้เขียนคำตอบอยู่ในรูปของเลขจำนวนจริง 4 ตำแหน่ง เช่น -0.1230 เป็นต้น
หมายเหตุ หากมีเรคคอร์ดที่มีค่า id เท่ากัน ให้เรคคอร์ดในไฟล์ที่มาก่อนจะถูกใช้คำนวณก่อน
*/